Repository: Ali-Algazar/zad-app
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Zad El Kheir Platform
ar: منصة زاد الخير

# reduceWasteSlogan
source: Together, we reduce waste and save food
ar: معاً نقلل الهدر وننقذ الطعام

source: Skip
ar: تخطي

source: Donate Easily
ar: تبرع بسهولة

# shareSurplusFood
source: Share surplus food with those in need in your community with a single click
ar: شارك الطعام الفائض مع من يحتاجه في مجتمعك بضغطة زر واحدة

source: Receive and Distribute
ar: استلم ووزع

# getInstantNotifications
source: Get instant notifications for nearby donations and distribute them to the needy
ar: احصل على إشعارات فورية للتبرعات القريبة منك ووزعها على المحتاجين

# bePartOfChange
source: Be Part of the Change
ar: كن جزءاً من التغيير

# contributeToReducingWaste
source: Contribute to reducing food waste and protecting the environment while helping families in need
ar: ساهم في تقليل هدر الطعام وحماية البيئة مع مساعدة الأسر المحتاجة

source: Start Your Journey Now
ar: ابدأ رحلتك الآن

# joinThousandsOfVolunteers
source: Join thousands of volunteers and donors across Egypt
ar: انضم إلى آلاف المتطوعين والمتبرعين في جميع أنحاء مصر

source: Start Now
ar: ابدأ الآن

source: Next
ar: التالي

source: Login
ar: تسجيل الدخول

source: Welcome Back
ar: مرحباً بك مرة أخرى

source: Email
ar: البريد الإلكتروني

# enterEmail
source: Enter your email
ar: أدخل البريد الإلكتروني

source: Password
ar: كلمة المرور

# enterPassword
source: Enter your password
ar: أدخل كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Create Account
ar: إنشاء حساب

source: Create New Account
ar: إنشاء حساب جديد

# joinUsMakeDifference
source: Join us and start making a difference
ar: انضم إلينا وابدأ في إحداث فرق

# phoneNumberRequired
source: Phone Number
ar: رقم الهاتف

# phoneExample
source: Example: 01234567890
ar: مثال: 01234567890

# fullNameRequired
source: Full Name
ar: الاسم بالكامل

# enterFullName
source: Enter your full name
ar: أدخل اسمك الكامل

source: City
ar: المدينة

# enterCity
source: Enter your city
ar: أدخل المدينة

source: Choose Role
ar: اختر الدور

# donorRoleDesc
source: Donor - I have surplus food to donate
ar: متبرع - لديّ طعام فائض للتبرع

# volunteerRoleDesc
source: Volunteer - I want to help distribute food
ar: متطوع - أريد المساعدة في توزيع الطعام

# recipientRoleDesc
source: Recipient - I am looking for food assistance
ar: مستلم - أبحث عن مساعدات غذائية

# agreeTo
source: I agree to
ar: أوافق على

# terms
source: the Terms and Conditions
ar: الشروط والأحكام

source: and
ar: و

# privacy
source: Privacy Policy
ar: سياسة الخصوصية

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# forgotPasswordTitle
source: Forgot Password?
ar: نسيت كلمة المرور؟

# dontWorryResetInstructions
source: Don't worry, we will send you password reset instructions
ar: لا تقلق، سنرسل لك تعليمات إعادة تعيين كلمة المرور

source: Send Code
ar: إرسال الكود

source: Verify Phone Number
ar: تأكيد رقم الهاتف

source: Verification code sent to
ar: تم إرسال رمز التحقق إلى

source: Resend code after
ar: إعادة إرسال الرمز بعد

source: Confirm
ar: تأكيد

source: Reset Password
ar: إعادة تعيين كلمة المرور

# chooseStrongPassword
source: Choose a new, strong password for your account
ar: اختر كلمة مرور جديدة وقوية لحسابك

# newPasswordRequired
source: New Password
ar: كلمة المرور الجديدة

source: Enter new password
ar: أدخل كلمة المرور الجديدة

source: At least 8 characters
ar: 8 أحرف على الأقل

# atLeastOneUppercase
source: At least one uppercase letter
ar: حرف كبير واحد على الأقل

# atLeastOneSpecialChar
source: Use at least one special character
ar: استخدم رمز واحد على الأقل من الرموز

source: Change Password
ar: تغيير كلمة المرور

source: Back
ar: رجوع

# chooseRecoveryMethodDesc
source: Don't worry, choose your preferred method to recover your account and we will send you password reset instructions
ar: لا تقلق، اختر الطريقة المفضلة لاستعادة حسابك وسنرسل لك تعليمات إعادة تعيين كلمة المرور

source: Send reset link via email
ar: إرسال رابط إعادة التعيين عبر البريد الإلكتروني

# sendVerificationCodeViaSMS
source: Send verification code via SMS text message
ar: إرسال رمز التحقق عبر رسالة نصية (SMS)

# recoveryTip
source: 💡 Tip: Choose the method you currently have access to so you can recover your account quickly.
ar: 💡 نصيحة: اختر الطريقة التي لديك إمكانية الوصول إليها الآن لاستعادة حسابك بسرعة

source: Recover via Email
ar: استعادة عبر البريد الإلكتروني

# enterRegisteredEmailDesc
source: Enter the email registered to your account and we will send you a link to reset your password
ar: أدخل البريد الإلكتروني المسجل في حسابك وسنرسل لك رابط لإعادة تعيين كلمة المرور

# registeredEmailRequired
source: Registered Email *
ar: البريد الإلكتروني المسجل

# secureLinkNotice
source: We will send you a secure link to reset your password. Check your inbox and spam folder.
ar: سنرسل لك رابط آمن لإعادة تعيين كلمة المرور. تحقق من صندوق الوارد والبريد المزعج (Spam).

source: Send Recovery Link
ar: إرسال رابط الاستعادة

source: Recover via Phone Number
ar: استعادة عبر رقم الهاتف

# enterRegisteredPhoneDesc
source: Enter the phone number registered to your account and we will send you a verification code to reset your password
ar: أدخل رقم الهاتف المسجل في حسابك وسنرسل لك رمز التحقق لإعادة تعيين كلمة المرور

# registeredPhoneRequired
source: Registered Phone Number *
ar: رقم الهاتف المسجل

# smsVerificationNotice
source: Make sure to enter the phone number registered to your account. A 6-digit verification code will be sent via SMS.
ar: تأكد من إدخال رقم الهاتف المسجل في حسابك. سيتم إرسال رمز التحقق المكون من 6 أرقام عبر رسالة SMS.

# forgotPasswordText
source: Forgot Password
ar: نسيت كلمة المرور

# enterValidEgyptianPhone
source: Please enter a valid 11-digit Egyptian phone number
ar: الرجاء إدخال رقم هاتف مصري صحيح مكون من 11 رقمًا

source: Confirm Password
ar: تأكيد كلمة المرور

source: Enter confirm password
ar: أدخل تأكيد كلمة المرور

source: Password Changed Successfully
ar: تم تغيير كلمة السر بنجاح

# nowUseNewPasswordToLogin
source: You can now use your new password to log in to your account.
ar: يمكنك الآن استخدام كلمة السر الجديدة لتسجيل الدخول إلى حسابك.

source: Go to Login Page
ar: الذهاب لصفحة تسجيل الدخول

source: Invalid OTP Code
ar: رمز الـ OTP غير صحيح

# otpMismatchErrorMsg
source: Unfortunately, the code you entered is incorrect. Please check the SMS sent to your mobile phone and try again.
ar: للأسف الرمز اللي دخلته مش هو اللي بعتناه. راجع الرمز اللي وصلك على الموبايل في رسالة الـ SMS ودخله تاني.

source: Try Again
ar: حاول مرة أخرى

source: Login Failed
ar: فشل تسجيل الدخول

# loginFailedErrorMsg
source: Sorry, we were unable to log you in. Please check your email and password and try again.
ar: عذرًا، لم نتمكن من تسجيل دخولك. يرجى التحقق من بريدك الإلكتروني وكلمة السر والمحاولة مرة أخرى.

source: Confirm Email
ar: تأكيد البريد الإلكتروني

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية

source: Welcome to Zad App
ar: مرحباً بك في تطبيق زاد

# privacyPolicyIntro
source: At "Zad", we respect your privacy and are committed to protecting your personal data. This policy explains how we collect, use, and protect the information you provide us while using the app to save food and deliver it to those in need.
ar: نحن في "زاد" نحترم خصوصيتك ونلتزم بحماية بياناتك الشخصية. توضح هذه السياسة كيفية جمعنا واستخدامنا وحمايتنا للمعلومات التي تقدمها لنا أثناء استخدامك للتطبيق بهدف إنقاذ الطعام وتوصيله للمحتاجين.

# infoWeCollectTitle
source: 1. Information We Collect
ar: 1. المعلومات التي نجمعها

# infoWeCollectBody
source: • Basic Data: Such as name, phone number, and email upon registration. • Location Data: We use your location to show the nearest available donations to you as a volunteer, or to locate the restaurant to facilitate the pickup process. • Usage Data: Such as in-app interactions and points collected in the rewards system.
ar: • البيانات الأساسية: مثل الاسم، رقم الهاتف، والبريد الإلكتروني عند التسجيل. • بيانات الموقع الجغرافي (Location): نستخدم موقعك لعرض أقرب التبرعات المتاحة لك كمتطوع، أو لتحديد موقع المطعم لتسهيل عملية الاستلام. • بيانات الاستخدام: مثل التفاعلات داخل التطبيق، والنقاط التي تم جمعها في نظام المكافآت.

# howWeUseInfoTitle
source: 2. How We Use Your Information?
ar: 2. كيف نستخدم معلوماتك؟

# howWeUseInfoBody
source: • To connect restaurants and donors with nearby volunteers. • To send Push Notifications for new deliveries and order statuses. • To improve user experience and provide faster technical support. • To calculate app statistics such as (saved meals and reduced carbon emissions).
ar: • لتوصيل المطاعم والمتبرعين بالمتطوعين القريبين جغرافياً. • لإرسال إشعارات (Push Notifications) بالتسليمات الجديدة وحالات الطلبات. • لتحسين تجربة المستخدم وتقديم دعم فني أسرع. • لحساب إحصائيات التطبيق مثل (الوجبات المنقذة وانبعاثات الكربون التي تم تقليلها).

# dataSharingTitle
source: 3. Data Sharing
ar: 3. مشاركة البيانات

# dataSharingBody
source: We do not sell your personal data to any third party. We may share limited information (such as the volunteer's name, phone number, and location) with the concerned restaurant only to ensure the safe and fast delivery of the donation.
ar: نحن لا نبيع بياناتك الشخصية لأي طرف ثالث. قد نشارك معلومات محدودة (مثل اسم المتطوع ورقم هاتفه وموقعه) مع المطعم المعني فقط لضمان نجاح عملية تسليم التبرع بأمان وسرعة.

# dataProtectionTitle
source: 4. Data Protection
ar: 4. حماية البيانات

# dataProtectionBody
source: We take all reasonable technical and security measures to protect your data from unauthorized access, modification, or disclosure. Passwords are encrypted and the connection to our databases is secured.
ar: نتخذ كافة التدابير التقنية والأمنية المعقولة لحماية بياناتك من الوصول غير المصرح به أو التعديل أو الإفشاء. يتم تشفير كلمات المرور وتأمين الاتصال بقواعد البيانات الخاصة بنا.

# yourRightsTitle
source: 5. Your Rights
ar: 5. حقوقك

# yourRightsBody
source: You have the right at any time to modify your personal data through the "My Account" page, or request the permanent deletion of the account and all associated data by contacting technical support.
ar: يحق لك في أي وقت تعديل بياناتك الشخصية من خلال صفحة "حسابي"، أو طلب حذف الحساب نهائياً ومسح كافة بياناتك المرتبطة به بالتواصل مع الدعم الفني.

# readAndAgree
source: I Read and Agree
ar: قرأت وأوافق
